{
  "id": "bible-year",
  "title": "Bible in a Year",
  "description": "Read through the entire Bible in one year with daily readings from both Old and New Testament",
  "duration": "12 months",
  "totalDays": 365,
  "lessons": [
    {
      "day": 1,
      "title": "Creation and God's Purpose",
      "scripture": "Genesis 1:1-2:3",
      "content": "We begin our journey through Scripture with the creation account. God, through His infinite power and wisdom, creates the heavens and earth. Each day of creation reveals God's orderly nature and purposeful design. The repetition of 'God saw that it was good' emphasizes the inherent value and purpose of all creation.",
      "keyThemes": [
        "Creation",
        "God's sovereignty",
        "Divine order",
        "Purpose in creation"
      ],
      "reflectionQuestions": [
        "What does the creation account reveal about God's character?",
        "How does seeing God as Creator impact your daily life?",
        "What pattern do you see in how God creates?",
        "What does it mean to be created in God's image?"
      ],
      "practicalApplication": "Take time today to observe and appreciate God's creation around you. Write down three specific ways you see God's creative power and wisdom displayed in nature. Consider how you can better fulfill your role as a steward of His creation.",
      "completed": false
    },
    {
      "day": 2,
      "title": "The Garden and The Fall",
      "scripture": "Genesis 2:4-3:24",
      "content": "Today's reading introduces us to the Garden of Eden and humanity's first sin. We see God's perfect provision in the garden, His establishment of marriage, and the tragic consequences of disobedience. This passage sets up the fundamental conflict that the rest of Scripture addresses: humanity's need for redemption.",
      "keyThemes": [
        "God's provision",
        "Human responsibility",
        "Sin and its consequences",
        "Promise of redemption"
      ],
      "reflectionQuestions": [
        "What does the Garden of Eden tell us about God's ideal for human life?",
        "How do you see the effects of the fall in today's world?",
        "What hope can we find in God's response to Adam and Eve's sin?",
        "How does this passage help us understand our need for salvation?"
      ],
      "practicalApplication": "Identify areas in your life where you might be doubting God's goodness or provision. Pray for strength to resist temptation and trust in God's perfect plan.",
      "completed": false
    }
  ]
}